import axios from "axios";
import Image from "next/image";
import { compileMDX } from "next-mdx-remote/rsc"

const PostPage = async ({
     params: {
          locale,
          category,
          slug
     }
}: {
     params: {
          locale: string,
          category: string,
          slug: string
     }
}) => {
     const res = await axios.get(`${process.env.BACKEND_URL}/posts?locale=${locale}&populate=*&filters[slug][$contains]=${slug}`, {
          headers: {
               Authorization:
                    `Bearer ${process.env.BACKEND_API_KEY}`,
          },
     })

     const posts = res.data;

     const { frontmatter, content } = await compileMDX({
          source: posts.data[0].attributes.desc,
     })

     return (
          <div className="flex flex-col h-full space-y-[30px]">
               <p className="font-bold text-[25px] sm:text-[35px] leading-[50px] sm:leading-[70px]">
                    {posts.data[0].attributes.title}
               </p>
               <div className="bg-black bg-opacity-[5%] dark:bg-white dark:bg-opacity-[5%] w-full aspect-[5/3]">
                    <Image
                         src={`https://api.omidshabab.com/${posts.data[0].attributes.image.data?.attributes?.url}`}
                         alt="image"
                         width={0}
                         height={0}
                         sizes="100vw"
                         style={{ width: '100%', height: 'auto' }}
                         layout="responsive"
                    />
               </div>
               <div
               // className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600"
               >
                    {content}
               </div>
               {/* <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    {posts.data[0].attributes.desc_block}
               </div> */}
               {/* <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
               </div>
               <h2 className="text-[22px] sm:text-[30px] font-semibold leading-[50px]">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
               </h2>
               <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
               </div>
               <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
               </div>
               <h2 className="text-[22px] sm:text-[30px] font-semibold leading-[50px]">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
               </h2>
               <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
               </div>
               <div className="text-[20px] leading-[50px] sm:text-[25px] sm:leading-[60px] text-slate-600">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
               </div> */}
          </div>
     )
}

export default PostPage